Import("\\settings\\static_script\\lib\\globalfunction\\gf_room_weight.lua")
Import("\\script\\lib\\globalfunctions.lua")

tBoxes = {
    -- [PackItemId(G,D,P)] = {
    --     {"szName", {g, d, p, n, status, bind}, body },
    -- },
    [PackItemId(2,1,31363)] = {--±Ìº£ÇïÏ¦Íâ×°°ü
        {"Thu TŞch Qu¸n", {0, 108, 1029, 1, 5, 1}, 1 },
        {"Thu TŞch Qu¸n", {0, 108, 1030, 1, 5, 1}, 2 },
        {"Thu TŞch Tr©m", {0, 108, 1031, 1, 5, 1}, 3 },
        {"Thu TŞch Tr©m", {0, 108, 1032, 1, 5, 1}, 4 },
        {"Thu TŞch Y", {0, 109, 1029, 1, 5, 1}, 1 },
        {"Thu TŞch Y", {0, 109, 1030, 1, 5, 1}, 2 },
        {"Thu TŞch Y", {0, 109, 1031, 1, 5, 1}, 3 },
        {"Thu TŞch Y", {0, 109, 1032, 1, 5, 1}, 4 },
        {"Thu TŞch Trang", {0, 110, 1029, 1, 5, 1}, 1 },
        {"Thu TŞch Trang", {0, 110, 1030, 1, 5, 1}, 2 },
        {"Thu TŞch Trang", {0, 110, 1031, 1, 5, 1}, 3 },
        {"Thu TŞch Trang", {0, 110, 1032, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31511)] = {--Ë¸ÓñÁ÷½ğ(Í·)Íâ×°°ü
        {"Ngäc Kim Qu¸n", {0, 108, 1017, 1, 5, 1}, 1 },
        {"Ngäc Kim Qu¸n", {0, 108, 1018, 1, 5, 1}, 2 },
        {"Ngäc Kim Tr©m", {0, 108, 1019, 1, 5, 1}, 3 },
        {"Ngäc Kim Tr©m", {0, 108, 1020, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31512)] = {--Ë¸ÓñÁ÷½ğ£¨ÉÏ×°£©Íâ×°°ü
        {"Ngäc Kim Y", {0, 109, 1017, 1, 5, 1}, 1 },
        {"Ngäc Kim Y", {0, 109, 1018, 1, 5, 1}, 2 },
        {"Ngäc Kim Y", {0, 109, 1019, 1, 5, 1}, 3 },
        {"Ngäc Kim Y", {0, 109, 1020, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31513)] = {--Ë¸ÓñÁ÷½ğ£¨ÏÂ×°£©Íâ×°°ü
        {"Ngäc Kim Trang", {0, 110, 1017, 1, 5, 1}, 1 },
        {"Ngäc Kim Trang", {0, 110, 1018, 1, 5, 1}, 2 },
        {"Ngäc Kim Trang", {0, 110, 1019, 1, 5, 1}, 3 },
        {"Ngäc Kim Trang", {0, 110, 1020, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31358)] = {--¿´Öì³É±ÌÍâ×°°ü
        {"Chu Bİch Qu¸n", {0, 108, 1001, 1, 5, 1}, 1 },
        {"Chu Bİch Qu¸n", {0, 108, 1002, 1, 5, 1}, 2 },
        {"Chu Bİch Tr©m", {0, 108, 1003, 1, 5, 1}, 3 },
        {"Chu Bİch Tr©m", {0, 108, 1004, 1, 5, 1}, 4 },
        {"Chu Bİch Y", {0, 109, 1001, 1, 5, 1}, 1 },
        {"Chu Bİch Y", {0, 109, 1002, 1, 5, 1}, 2 },
        {"Chu Bİch Y", {0, 109, 1003, 1, 5, 1}, 3 },
        {"Chu Bİch Y", {0, 109, 1004, 1, 5, 1}, 4 },
        {"Chu Bİch Trang", {0, 110, 1001, 1, 5, 1}, 1 },
        {"Chu Bİch Trang", {0, 110, 1002, 1, 5, 1}, 2 },
        {"Chu Bİch Trang", {0, 110, 1003, 1, 5, 1}, 3 },
        {"Chu Bİch Trang", {0, 110, 1004, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31364)] = {--Å¯ÈÕºÍ·çÍâ×°°ü
        {"Hßa Phong Qu¸n", {0, 108, 1037, 1, 5, 1}, 1 },
        {"Hßa Phong Qu¸n", {0, 108, 1038, 1, 5, 1}, 2 },
        {"Hßa Phong Tr©m", {0, 108, 1039, 1, 5, 1}, 3 },       
        {"Hßa Phong Tr©m", {0, 108, 1040, 1, 5, 1}, 4 },
        {"Hßa Phong Y", {0, 109, 1037, 1, 5, 1}, 1 },
        {"Hßa Phong Y", {0, 109, 1038, 1, 5, 1}, 2 },
        {"Hßa Phong Y", {0, 109, 1039, 1, 5, 1}, 3 },
        {"Hßa Phong Y", {0, 109, 1040, 1, 5, 1}, 4 },
        {"Hßa Phong Trang", {0, 110, 1037, 1, 5, 1}, 1 },
        {"Hßa Phong Trang", {0, 110, 1038, 1, 5, 1}, 2 },
        {"Hßa Phong Trang", {0, 110, 1039, 1, 5, 1}, 3 },
        {"Hßa Phong Trang", {0, 110, 1040, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31359)] = {--³¤ÀÖÎ´ÑëÍâ×°°ü
        {"VŞ ¦¬ng Qu¸n", {0, 108, 1013, 1, 5, 1}, 1 },
        {"VŞ ¦¬ng Qu¸n", {0, 108, 1014, 1, 5, 1}, 2 },
        {"VŞ ¦¬ng Tr©m", {0, 108, 1015, 1, 5, 1}, 3 },       
        {"VŞ ¦¬ng Tr©m", {0, 108, 1016, 1, 5, 1}, 4 },
        {"VŞ ¦¬ng Y", {0, 109, 1013, 1, 5, 1}, 1 },
        {"VŞ ¦¬ng Y", {0, 109, 1014, 1, 5, 1}, 2 },
        {"VŞ ¦¬ng Y", {0, 109, 1015, 1, 5, 1}, 3 },
        {"VŞ ¦¬ng Y", {0, 109, 1016, 1, 5, 1}, 4 },
        {"VŞ ¦¬ng Trang", {0, 110, 1013, 1, 5, 1}, 1 },
        {"VŞ ¦¬ng Trang", {0, 110, 1014, 1, 5, 1}, 2 },
        {"VŞ ¦¬ng Trang", {0, 110, 1015, 1, 5, 1}, 3 },
        {"VŞ ¦¬ng Trang", {0, 110, 1016, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31376)] = {--Çç¿Õ±ÌÏöÍâ×°°ü
        {"Bİch Tiªu Qu¸n", {0, 108, 1093, 1, 5, 1}, 1 },
        {"Bİch Tiªu Qu¸n", {0, 108, 1094, 1, 5, 1}, 2 },
        {"Bİch Tiªu Tr©m", {0, 108, 1095, 1, 5, 1}, 3 },       
        {"Bİch Tiªu Tr©m", {0, 108, 1096, 1, 5, 1}, 4 },
        {"Bİch Tiªu Y", {0, 109, 1093, 1, 5, 1}, 1 },
        {"Bİch Tiªu Y", {0, 109, 1094, 1, 5, 1}, 2 },
        {"Bİch Tiªu Y", {0, 109, 1095, 1, 5, 1}, 3 },
        {"Bİch Tiªu Y", {0, 109, 1096, 1, 5, 1}, 4 },
        {"Bİch Tiªu Trang", {0, 110, 1093, 1, 5, 1}, 1 },
        {"Bİch Tiªu Trang", {0, 110, 1094, 1, 5, 1}, 2 },
        {"Bİch Tiªu Trang", {0, 110, 1095, 1, 5, 1}, 3 },
        {"Bİch Tiªu Trang", {0, 110, 1096, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31498)] = {--ËªÇ°ÔÂÏÂ¹Ò¼ş
        {"S­¬ng Tr¾ng Tranh Thanh", {0, 119, 375, 1, 5, 1}, 1 },
        {"S­¬ng Tr¾ng Tranh Thanh", {0, 119, 376, 1, 5, 1}, 2 },
        {"S­¬ng Tr¾ng Tranh Thanh", {0, 119, 377, 1, 5, 1}, 3 },       
        {"S­¬ng Tr¾ng Tranh Thanh", {0, 119, 378, 1, 5, 1}, 4 },
        {"Nhôy §á Máng Manh", {0, 120, 375, 1, 5, 1}, 1 },
        {"Nhôy §á Máng Manh", {0, 120, 376, 1, 5, 1}, 2 },
        {"Nhôy §á Máng Manh", {0, 120, 377, 1, 5, 1}, 3 },
        {"Nhôy §á Máng Manh", {0, 120, 378, 1, 5, 1}, 4 },
        {"Quúnh Ng¹c", {0, 121, 375, 1, 5, 1}, 1 },
        {"Quúnh Ng¹c", {0, 121, 376, 1, 5, 1}, 2 },
        {"Quúnh Ng¹c", {0, 121, 377, 1, 5, 1}, 3 },
        {"Quúnh Ng¹c", {0, 121, 378, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31497)] = {--Á÷»ğ¹ÒÊÎ£¨ºì£©
        {"L­u Quang (§á)", {0, 119, 13, 1, 5, 1}, 1 },
        {"L­u Quang (§á)", {0, 119, 14, 1, 5, 1}, 2 },
        {"L­u Quang (§á)", {0, 119, 15, 1, 5, 1}, 3 },       
        {"L­u Quang (§á)", {0, 119, 16, 1, 5, 1}, 4 },
        {"Tinh Th¸i (§á)", {0, 121, 13, 1, 5, 1}, 1 },
        {"Tinh Th¸i (§á)", {0, 121, 14, 1, 5, 1}, 2 },
        {"Tinh Th¸i (§á)", {0, 121, 15, 1, 5, 1}, 3 },
        {"Tinh Th¸i (§á)", {0, 121, 16, 1, 5, 1}, 4 },
        {"Trî Phông T­êng Loan (§á)", {0, 120, 13, 1, 5, 1}, 1 },
        {"Trî Phông T­êng Loan (§á)", {0, 120, 14, 1, 5, 1}, 2 },
        {"Trî Phông T­êng Loan (§á)", {0, 120, 15, 1, 5, 1}, 3 },
        {"Trî Phông T­êng Loan (§á)", {0, 120, 16, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31496)] = {--Á÷ĞÇ¹ÒÊÎ£¨À¶£©
        {"L­u Quang (Lam)", {0, 119, 21, 1, 5, 1}, 1 },
        {"L­u Quang (Lam)", {0, 119, 22, 1, 5, 1}, 2 },
        {"L­u Quang (Lam)", {0, 119, 23, 1, 5, 1}, 3 },       
        {"L­u Quang (Lam)", {0, 119, 24, 1, 5, 1}, 4 },
        {"Tinh Th¸i (Lam)", {0, 121, 21, 1, 5, 1}, 1 },
        {"Tinh Th¸i (Lam)", {0, 121, 22, 1, 5, 1}, 2 },
        {"Tinh Th¸i (Lam)", {0, 121, 23, 1, 5, 1}, 3 },
        {"Tinh Th¸i (Lam)", {0, 121, 24, 1, 5, 1}, 4 },
        {"Trî Ph­îng T­êng Loan (Lam)", {0, 120, 21, 1, 5, 1}, 1 },
        {"Trî Ph­îng T­êng Loan (Lam)", {0, 120, 22, 1, 5, 1}, 2 },
        {"Trî Ph­îng T­êng Loan (Lam)", {0, 120, 23, 1, 5, 1}, 3 },
        {"Trî Ph­îng T­êng Loan (Lam)", {0, 120, 24, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31495)] = {--ĞÇº£¹ÒÊÎ£¨ºì£©
        {"Nh­ ı(®á)", {0, 119,  9, 1, 5, 1}, 1 },
        {"Nh­ ı(®á)", {0, 119, 10, 1, 5, 1}, 2 },
        {"Nh­ ı(®á)", {0, 119, 11, 1, 5, 1}, 3 },       
        {"Nh­ ı(®á)", {0, 119, 12, 1, 5, 1}, 4 },
        {"Siªu Phong(®á)", {0, 121,  9, 1, 5, 1}, 1 },
        {"Siªu Phong(®á)", {0, 121, 10, 1, 5, 1}, 2 },
        {"Siªu Phong(®á)", {0, 121, 11, 1, 5, 1}, 3 },
        {"Siªu Phong(®á)", {0, 121, 12, 1, 5, 1}, 4 },
        {"Oanh TrÇn Vò(®á)", {0, 120,  9, 1, 5, 1}, 1 },
        {"Oanh TrÇn Vò(®á)", {0, 120, 10, 1, 5, 1}, 2 },
        {"Oanh TrÇn Vò(®á)", {0, 120, 11, 1, 5, 1}, 3 },
        {"Oanh TrÇn Vò(®á)", {0, 120, 12, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31494)] = {--ĞÇº£¹ÒÊÎ£¨À¶£©
        {"Nh­ ı (Lam)", {0, 119, 1, 1, 5, 1}, 1 },
        {"Nh­ ı (Lam)", {0, 119, 2, 1, 5, 1}, 2 },
        {"Nh­ ı (Lam)", {0, 119, 3, 1, 5, 1}, 3 },       
        {"Nh­ ı (Lam)", {0, 119, 4, 1, 5, 1}, 4 },
        {"Siªu Phong (Lam)", {0, 121, 1, 1, 5, 1}, 1 },
        {"Siªu Phong (Lam)", {0, 121, 2, 1, 5, 1}, 2 },
        {"Siªu Phong (Lam)", {0, 121, 3, 1, 5, 1}, 3 },
        {"Siªu Phong (Lam)", {0, 121, 4, 1, 5, 1}, 4 },
        {"Oanh TrÇn Vò (Lam)", {0, 120, 1, 1, 5, 1}, 1 },
        {"Oanh TrÇn Vò (Lam)", {0, 120, 2, 1, 5, 1}, 2 },
        {"Oanh TrÇn Vò (Lam)", {0, 120, 3, 1, 5, 1}, 3 },
        {"Oanh TrÇn Vò (Lam)", {0, 120, 4, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31368)] = {--°µÏãÓ¯ĞäÍâ×°°ü
        {"Doanh Tô Qu¸n", {0, 108, 1061, 1, 5, 1}, 1 },
        {"Doanh Tô Qu¸n", {0, 108, 1062, 1, 5, 1}, 2 },
        {"Doanh Tô Tr©m", {0, 108, 1063, 1, 5, 1}, 3 },
        {"Doanh Tô Tr©m", {0, 108, 1064, 1, 5, 1}, 4 },
        {"Doanh Tô Y", {0, 109, 1061, 1, 5, 1}, 1 },
        {"Doanh Tô Y", {0, 109, 1062, 1, 5, 1}, 2 },
        {"Doanh Tô Y", {0, 109, 1063, 1, 5, 1}, 3 },
        {"Doanh Tô Y", {0, 109, 1064, 1, 5, 1}, 4 },
        {"Doanh Tô Trang", {0, 110, 1061, 1, 5, 1}, 1 },
        {"Doanh Tô Trang", {0, 110, 1062, 1, 5, 1}, 2 },
        {"Doanh Tô Trang", {0, 110, 1063, 1, 5, 1}, 3 },
        {"Doanh Tô Trang", {0, 110, 1064, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31377)] = {--ÂäÈÕ¹Â³ÇÍâ×°°ü
        {"C« Thµnh Qu¸n", {0, 108, 1097, 1, 5, 1}, 1 },
        {"C« Thµnh Qu¸n", {0, 108, 1098, 1, 5, 1}, 2 },
        {"C« Thµnh Tr©m", {0, 108, 1099, 1, 5, 1}, 3 },
        {"C« Thµnh Tr©m", {0, 108, 1100, 1, 5, 1}, 4 },
        {"C« Thµnh Y", {0, 109, 1097, 1, 5, 1}, 1 },
        {"C« Thµnh Y", {0, 109, 1098, 1, 5, 1}, 2 },
        {"C« Thµnh Y", {0, 109, 1099, 1, 5, 1}, 3 },
        {"C« Thµnh Y", {0, 109, 1100, 1, 5, 1}, 4 },
        {"C« Thµnh Trang", {0, 110, 1097, 1, 5, 1}, 1 },
        {"C« Thµnh Trang", {0, 110, 1098, 1, 5, 1}, 2 },
        {"C« Thµnh Trang", {0, 110, 1099, 1, 5, 1}, 3 },
        {"C« Thµnh Trang", {0, 110, 1100, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31332)] = {--åĞÒ£ÒÂ£¨ºÚ&·Û£©Íâ×°°ü
        {"Tiªu Dao Qu¸n (®en huyÒn bİ)", {0, 108, 818, 1, 5, 1}, 1 },
        {"Tiªu Dao Qu¸n (®en huyÒn bİ)", {0, 108, 823, 1, 5, 1}, 2 },
        {"Tiªu Dao Qu¸n (hång m¬ méng)", {0, 108, 411, 1, 5, 1}, 3 },
        {"Tiªu Dao Qu¸n (hång m¬ méng)", {0, 108, 401, 1, 5, 1}, 4 },
        {"Tiªu Dao Y (§en)", {0, 109, 818, 1, 5, 1}, 1 },
        {"Tiªu Dao Y (§en)", {0, 109, 823, 1, 5, 1}, 2 },
        {"Tiªu Dao Th­êng (hång m¬ méng)", {0, 109, 411, 1, 5, 1}, 3 },
        {"Tiªu Dao Th­êng (hång m¬ méng)", {0, 109, 401, 1, 5, 1}, 4 },
        {"Tiªu Dao Trang (§en)", {0, 110, 818, 1, 5, 1}, 1 },
        {"Tiªu Dao Trang (§en)", {0, 110, 823, 1, 5, 1}, 2 },
        {"Tiªu Dao Trang (Méng C¶nh PhÊn)", {0, 110, 211, 1, 5, 1}, 3 },
        {"Tiªu Dao Trang (Méng C¶nh PhÊn)", {0, 110, 201, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31331)] = {--åĞÒ£ÒÂ£¨×Ø&ºì£©Íâ×°°ü
        {"Tiªu Dao Qu¸n (N©u)", {0, 108, 817, 1, 5, 1}, 1 },
        {"Tiªu Dao Qu¸n (N©u)", {0, 108, 822, 1, 5, 1}, 2 },
        {"Tiªu Dao Qu¸n (®á hoa hång)", {0, 108, 412, 1, 5, 1}, 3 },
        {"Tiªu Dao Qu¸n (®á hoa hång)", {0, 108, 402, 1, 5, 1}, 4 },
        {"Tiªu Dao Y (N©u)", {0, 109, 817, 1, 5, 1}, 1 },
        {"Tiªu Dao Y (N©u)", {0, 109, 822, 1, 5, 1}, 2 },
        {"Tiªu Dao Th­êng (®á hoa hång)", {0, 109, 412, 1, 5, 1}, 3 },
        {"Tiªu Dao Th­êng (®á hoa hång)", {0, 109, 402, 1, 5, 1}, 4 },
        {"Tiªu Dao Trang (N©u)", {0, 110, 817, 1, 5, 1}, 1 },
        {"Tiªu Dao Trang (N©u)", {0, 110, 822, 1, 5, 1}, 2 },
        {"Tiªu Dao Trang (Mai Quı Hång)", {0, 110, 212, 1, 5, 1}, 3 },
        {"Tiªu Dao Trang (Mai Quı Hång)", {0, 110, 202, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31329)] = {--åĞÒ£ÒÂ£¨×Ï£©Íâ×°°ü
        {"Tiªu Dao Qu¸n (tİm sang träng)", {0, 108, 815, 1, 5, 1}, 1 },
        {"Tiªu Dao Qu¸n (tİm sang träng)", {0, 108, 820, 1, 5, 1}, 2 },
        {"Tiªu Dao Qu¸n (tİm than)", {0, 108, 409, 1, 5, 1}, 3 },
        {"Tiªu Dao Qu¸n (tİm than)", {0, 108, 399, 1, 5, 1}, 4 },
        {"Tiªu Dao Y (Tİm)", {0, 109, 815, 1, 5, 1}, 1 },
        {"Tiªu Dao Y (Tİm)", {0, 109, 820, 1, 5, 1}, 2 },
        {"Tiªu Dao Th­êng (tİm than)", {0, 109, 409, 1, 5, 1}, 3 },
        {"Tiªu Dao Th­êng (tİm than)", {0, 109, 399, 1, 5, 1}, 4 },
        {"Tiªu Dao Trang (Tİm)", {0, 110, 815, 1, 5, 1}, 1 },
        {"Tiªu Dao Trang (Tİm)", {0, 110, 820, 1, 5, 1}, 2 },
        {"Tiªu Dao Trang (La Lan Tö)", {0, 110, 209, 1, 5, 1}, 3 },
        {"Tiªu Dao Trang (La Lan Tö)", {0, 110, 199, 1, 5, 1}, 4 },
    },
	[PackItemId(2,1,31127)] = {--ä½ĞÜÃ±ºĞ×Ó
		-- {"szName", {g, d, p, n, status, bind}, body },
        {"Mò Ho¸n Hïng", {0, 108, 622, 1, 5, 1}, 1 },
        {"Mò Ho¸n Hïng", {0, 108, 623, 1, 5, 1}, 2 },
        {"Mò Ho¸n Hïng", {0, 108, 624, 1, 5, 1}, 3 },
        {"Mò Ho¸n Hïng", {0, 108, 625, 1, 5, 1}, 4 },
	},
	[PackItemId(2,1,31128)] = {--×ÓÒ¹×°ºĞ×Ó
        {"Tö D¹ qu¸n", {0, 108, 825, 1, 5, 1}, 1 },
        {"Tö D¹ qu¸n", {0, 108, 826, 1, 5, 1}, 2 },
        {"Tö D¹ tr©m", {0, 108, 827, 1, 5, 1}, 3 },
        {"Tö D¹ tr©m", {0, 108, 828, 1, 5, 1}, 4 },
        {"Tö D¹ y", {0, 109, 825, 1, 5, 1}, 1 },
        {"Tö D¹ y", {0, 109, 826, 1, 5, 1}, 2 },
        {"Tö D¹ y", {0, 109, 827, 1, 5, 1}, 3 },
        {"Tö D¹ y", {0, 109, 828, 1, 5, 1}, 4 },
        {"Tö D¹ Trang", {0, 110, 825, 1, 5, 1}, 1 },
        {"Tö D¹ Trang", {0, 110, 826, 1, 5, 1}, 2 },
        {"Tö D¹ QuÇn", {0, 110, 827, 1, 5, 1}, 3 },
        {"Tö D¹ QuÇn", {0, 110, 828, 1, 5, 1}, 4 },
	},
	[PackItemId(2,1,31129)] = {--ÌìÓğôÂôÄºĞ×Ó
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 713, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 714, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 715, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 716, 1, 5, 1}, 4 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 713, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 714, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 715, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 716, 1, 5, 1}, 4 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 713, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 714, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 715, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 716, 1, 5, 1}, 4 },
	},
		[PackItemId(2,1,31162)] = {--Ò¶ÉÏÇï·çÍâ×°ÀñºĞ
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 953, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 954, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 955, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (Nãn)", {0, 108, 956, 1, 5, 1}, 4 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 953, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 954, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 955, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (¸o)", {0, 109, 956, 1, 5, 1}, 4 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 953, 1, 5, 1}, 1 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 954, 1, 5, 1}, 2 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 955, 1, 5, 1}, 3 },
        {"Thiªn Vò Cµ Sa (QuÇn)", {0, 110, 956, 1, 5, 1}, 4 },
	},		
	[PackItemId(2,1,31163)] = {--ºì·ã¹Ò¼şÌ×ÀñºĞ
        {"Hång Phong KiÕm", {0, 120, 124, 1, 5, 1}, 1 },
        {"Hång Phong-Ch©n", {0, 121, 88, 1, 5, 1}, 1 },
        {"Hång Phong-Vai", {0, 119, 100, 1, 5, 1}, 1 },		
		{"Hång Phong KiÕm", {0, 120, 124, 1, 5, 1}, 2 },
        {"Hång Phong-Ch©n", {0, 121, 88, 1, 5, 1}, 2 },
        {"Hång Phong-Vai", {0, 119, 100, 1, 5, 1}, 2 },
		{"Hång Phong KiÕm", {0, 120, 124, 1, 5, 1}, 3 },
        {"Hång Phong-Ch©n", {0, 121, 88, 1, 5, 1}, 3 },
        {"Hång Phong-Vai", {0, 119, 100, 1, 5, 1}, 3 },
		{"Hång Phong KiÕm", {0, 120, 124, 1, 5, 1}, 4 },
        {"Hång Phong-Ch©n", {0, 121, 88, 1, 5, 1}, 4 },
        {"Hång Phong-Vai", {0, 119, 100, 1, 5, 1}, 4 },
	},
	[PackItemId(2,1,31165)] = {--±ùÄñ¹Ò¼şÀñºĞ(30Ìì)
        {"Chim B¨ng", {0, 120, 255, 1, 5, 1}, 1 },
        {"Chim B¨ng", {0, 120, 256, 1, 5, 1}, 2 },
        {"Chim B¨ng", {0, 120, 257, 1, 5, 1}, 3 },		
		{"Chim B¨ng", {0, 120, 258, 1, 5, 1}, 4 },		
	},
	[PackItemId(2,1,31166)] = {--Ç±Áú×°Íâ×°ÀñºĞ
        {"TiÒn Long C©n", {0, 108, 837, 1, 5, 1}, 1 },
        {"TiÒn Long C©n", {0, 108, 838, 1, 5, 1}, 2 },
        {"TiÒn Long C©n", {0, 108, 839, 1, 5, 1}, 3 },		
		{"TiÒn Long C©n", {0, 108, 840, 1, 5, 1}, 4 },	
		{"TiÒn Long y", {0, 109, 837, 1, 5, 1}, 1 },
        {"TiÒn Long y", {0, 109, 838, 1, 5, 1}, 2 },
        {"TiÒn Long y", {0, 109, 839, 1, 5, 1}, 3 },		
		{"TiÒn Long y", {0, 109, 840, 1, 5, 1}, 4 },		
		{"TiÒn Long Trang", {0, 110, 837, 1, 5, 1}, 1 },
        {"TiÒn Long Trang", {0, 110, 838, 1, 5, 1}, 2 },
        {"TiÒn Long Trang", {0, 110, 839, 1, 5, 1}, 3 },		
		{"TiÒn Long Trang", {0, 110, 840, 1, 5, 1}, 4 },	
	},
	[PackItemId(2,1,31199)] = {--²ßÂíÌìÏÂÍâ×°ÀñºĞ
        {"S¸ch M· Thiªn H¹ Qu¸n", {0, 108, 811, 1, 5, 1}, 1 },
        {"S¸ch M· Thiªn H¹ Qu¸n", {0, 108, 812, 1, 5, 1}, 2 },
        {"S¸ch M· Thiªn H¹ Tr©m", {0, 108, 813, 1, 5, 1}, 3 },		
		{"S¸ch M· Thiªn H¹ Tr©m", {0, 108, 814, 1, 5, 1}, 4 },	
		{"S¸ch M· Thiªn H¹ Bµo", {0, 109, 811, 1, 5, 1}, 1 },
        {"S¸ch M· Thiªn H¹ Bµo", {0, 109, 812, 1, 5, 1}, 2 },
        {"S¸ch M· Thiªn H¹ Th­êng", {0, 109, 813, 1, 5, 1}, 3 },		
		{"S¸ch M· Thiªn H¹ Th­êng", {0, 109, 814, 1, 5, 1}, 4 },		
		{"S¸ch M· Thiªn H¹ Trang", {0, 110, 811, 1, 5, 1}, 1 },
        {"S¸ch M· Thiªn H¹ Trang", {0, 110, 812, 1, 5, 1}, 2 },
        {"S¸ch M· Thiªn H¹ QuÇn", {0, 110, 813, 1, 5, 1}, 3 },		
		{"S¸ch M· Thiªn H¹ QuÇn", {0, 110, 814, 1, 5, 1}, 4 },	
	},
	[PackItemId(2,1,31200)] = {--Ë«·ÉÑà¹Ò¼şÀñºĞ£¨30Ìì£©
        {"BØ Dùc Song Phi", {0, 120, 259, 1, 5+30*24*3600*100, 1}, 1 },
        {"BØ Dùc Song Phi", {0, 120, 260, 1, 5+30*24*3600*100, 1}, 2 },
        {"BØ Dùc Song Phi", {0, 120, 261, 1, 5+30*24*3600*100, 1}, 3 },		
		{"BØ Dùc Song Phi", {0, 120, 262, 1, 5+30*24*3600*100, 1}, 4 },		
	},
    [PackItemId(2,1,31270)] = {--ÜÆË®Íâ×°ÀñºĞ 
        {"ChØ Thñy Quan", {0, 108, 833, 1, 5, 1}, 1 },
        {"ChØ Thñy Quan", {0, 108, 834, 1, 5, 1}, 2 },
        {"ChØ Thñy Tr©m", {0, 108, 835, 1, 5, 1}, 3 },		
        {"ChØ Thñy Tr©m", {0, 108, 836, 1, 5, 1}, 4 },	
        {"ChØ Thñy y", {0, 109, 833, 1, 5, 1}, 1 },
        {"ChØ Thñy y", {0, 109, 834, 1, 5, 1}, 2 },
        {"ChØ Thñy y", {0, 109, 835, 1, 5, 1}, 3 },		
        {"ChØ Thñy y", {0, 109, 836, 1, 5, 1}, 4 },		
        {"ChØ Thñy Trang", {0, 110, 833, 1, 5, 1}, 1 },
        {"ChØ Thñy Trang", {0, 110, 834, 1, 5, 1}, 2 },
        {"ChØ Thñy QuÇn", {0, 110, 835, 1, 5, 1}, 3 },		
        {"ChØ Thñy QuÇn", {0, 110, 836, 1, 5, 1}, 4 },	
    },
    [PackItemId(2,1,31286)] = {--ÎÊÇé×°Íâ×°ÀñºĞ 
        {"VÊn T×nh Qu¸n", {0, 108, 1009, 1, 5, 1}, 1 },
        {"VÊn T×nh Qu¸n", {0, 108, 1010, 1, 5, 1}, 2 },
        {"VÊn T×nh Tr©m", {0, 108, 1011, 1, 5, 1}, 3 },		
        {"VÊn T×nh Tr©m", {0, 108, 1012, 1, 5, 1}, 4 },	
        {"VÊn T×nh Y", {0, 109, 1009, 1, 5, 1}, 1 },
        {"VÊn T×nh Y", {0, 109, 1010, 1, 5, 1}, 2 },
        {"VÊn T×nh Y", {0, 109, 1011, 1, 5, 1}, 3 },		
        {"VÊn T×nh Y", {0, 109, 1012, 1, 5, 1}, 4 },		
        {"VÊn T×nh Trang", {0, 110, 1009, 1, 5, 1}, 1 },
        {"VÊn T×nh Trang", {0, 110, 1010, 1, 5, 1}, 2 },
        {"VÊn T×nh Trang", {0, 110, 1011, 1, 5, 1}, 3 },		
        {"VÊn T×nh Trang", {0, 110, 1012, 1, 5, 1}, 4 },	
    },
    [PackItemId(2,1,31289)] = {--Ó­´º×°ÀñºĞ(Í·) 
        {"Xu©n ı ¸ng Nhiªn Qu¸n", {0, 108, 1005, 1, 5, 1}, 1 },
        {"Xu©n ı ¸ng Nhiªn Qu¸n", {0, 108, 1006, 1, 5, 1}, 2 },
        {"Xu©n ı ¸ng Nhiªn Tr©m", {0, 108, 1007, 1, 5, 1}, 3 },		
        {"Xu©n ı ¸ng Nhiªn Tr©m", {0, 108, 1008, 1, 5, 1}, 4 },	
    },
    [PackItemId(2,1,31290)] = {--Ó­´º×°ÀñºĞ(ÒÂ) 
        {"Xu©n ı ¸ng Nhiªn Y", {0, 109, 1005, 1, 5, 1}, 1 },
        {"Xu©n ı ¸ng Nhiªn Y", {0, 109, 1006, 1, 5, 1}, 2 },
        {"Xu©n ı ¸ng Nhiªn Y", {0, 109, 1007, 1, 5, 1}, 3 },		
        {"Xu©n ı ¸ng Nhiªn Y", {0, 109, 1008, 1, 5, 1}, 4 },	
    },
    [PackItemId(2,1,31291)] = {--Ó­´º×°ÀñºĞ(¿ã) 
        {"Xu©n ı ¸ng Nhiªn Trang", {0, 110, 1005, 1, 5, 1}, 1 },
        {"Xu©n ı ¸ng Nhiªn Trang", {0, 110, 1006, 1, 5, 1}, 2 },
        {"Xu©n ı ¸ng Nhiªn Trang", {0, 110, 1007, 1, 5, 1}, 3 },		
        {"Xu©n ı ¸ng Nhiªn Trang", {0, 110, 1008, 1, 5, 1}, 4 },	
    },
    [PackItemId(2,1,31299)] = {
        {"KhÊt X¶o Nh­ ı Qu¸n", {0, 108, 1053, 1, 5, 1}, 1 },
        {"KhÊt X¶o Nh­ ı Qu¸n", {0, 108, 1054, 1, 5, 1}, 2 },
        {"KhÊt X¶o Nh­ ı Tr©m", {0, 108, 1055, 1, 5, 1}, 3 },
        {"KhÊt X¶o Nh­ ı Tr©m", {0, 108, 1056, 1, 5, 1}, 4 },
        {"KhÊt X¶o Nh­ ı Y", {0, 109, 1053, 1, 5, 1}, 1 },
        {"KhÊt X¶o Nh­ ı Y", {0, 109, 1054, 1, 5, 1}, 2 },
        {"KhÊt X¶o Nh­ ı Y", {0, 109, 1055, 1, 5, 1}, 3 },
        {"KhÊt X¶o Nh­ ı Y", {0, 109, 1056, 1, 5, 1}, 4 },
        {"KhÊt X¶o Nh­ ı Trang", {0, 110, 1053, 1, 5, 1}, 1 },
        {"KhÊt X¶o Nh­ ı Trang", {0, 110, 1054, 1, 5, 1}, 2 },
        {"KhÊt X¶o Nh­ ı Trang", {0, 110, 1055, 1, 5, 1}, 3 },
        {"KhÊt X¶o Nh­ ı Trang", {0, 110, 1056, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31380)] = {
        {"Phong L­u Qu¸n", {0, 108, 797, 1, 5, 1}, 1 },
        {"Phong L­u Qu¸n", {0, 108, 798, 1, 5, 1}, 2 },
        {"Phong L­u Tr©m", {0, 108, 799, 1, 5, 1}, 3 },
        {"Phong L­u Tr©m", {0, 108, 800, 1, 5, 1}, 4 },

        {"Phong L­u Y", {0, 109, 797, 1, 5, 1}, 1 },
        {"Phong L­u Y", {0, 109, 798, 1, 5, 1}, 2 },
        {"Phong L­u Y", {0, 109, 799, 1, 5, 1}, 3 },
        {"Phong L­u Y", {0, 109, 800, 1, 5, 1}, 4 },

        {"Phong L­u Trang", {0, 110, 797, 1, 5, 1}, 1 },
        {"Phong L­u Trang", {0, 110, 798, 1, 5, 1}, 2 },
        {"Phong L­u QuÇn", {0, 110, 799, 1, 5, 1}, 3 },
        {"Phong L­u QuÇn", {0, 110, 800, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31330)] = {
        {"Tiªu Dao Qu¸n (lam phiªu dËt)", {0, 108, 816, 1, 5, 1}, 1 },
        {"Tiªu Dao Qu¸n (lam phiªu dËt)", {0, 108, 821, 1, 5, 1}, 2 },
        {"Tiªu Dao Qu¸n (xanh biÓn)", {0, 108, 410, 1, 5, 1}, 3 },
        {"Tiªu Dao Qu¸n (xanh biÓn)", {0, 108, 400, 1, 5, 1}, 4 },

        {"Tiªu Dao Y (Lam)", {0, 109, 816, 1, 5, 1}, 1 },
        {"Tiªu Dao Y (Lam)", {0, 109, 821, 1, 5, 1}, 2 },
        {"Tiªu Dao Th­êng (xanh biÓn)", {0, 109, 410, 1, 5, 1}, 3 },
        {"Tiªu Dao Th­êng (xanh biÓn)", {0, 109, 400, 1, 5, 1}, 4 },

        {"Tiªu Dao Trang (Lam)", {0, 110, 816, 1, 5, 1}, 1 },
        {"Tiªu Dao Trang (Lam)", {0, 110, 821, 1, 5, 1}, 2 },
        {"Tiªu Dao Trang (B¨ng H¶i Lam)", {0, 110, 210, 1, 5, 1}, 3 },
        {"Tiªu Dao Trang (B¨ng H¶i Lam)", {0, 110, 200, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31388)] = {
        {"B¹ch Sa Qu¸n", {0, 108, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Qu¸n", {0, 108, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Tr©m", {0, 108, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Tr©m", {0, 108, 1076, 1, 5, 1}, 4 },

        {"B¹ch Sa Y", {0, 109, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Y", {0, 109, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Y", {0, 109, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Y", {0, 109, 1076, 1, 5, 1}, 4 },

        {"B¹ch Sa Trang", {0, 110, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Trang", {0, 110, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Trang", {0, 110, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Trang", {0, 110, 1076, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31389)] = {
        {"Mai LiÔu Qu¸n", {0, 108, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Qu¸n", {0, 108, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Tr©m", {0, 108, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Tr©m", {0, 108, 1080, 1, 5, 1}, 4 },

        {"Mai LiÔu Y", {0, 109, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Y", {0, 109, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Y", {0, 109, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Y", {0, 109, 1080, 1, 5, 1}, 4 },

        {"Mai LiÔu Trang", {0, 110, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Trang", {0, 110, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Trang", {0, 110, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Trang", {0, 110, 1080, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31387)] = {
        {"Hång ¶nh Qu¸n", {0, 108, 917, 1, 5, 1}, 1 },
        {"Hång ¶nh Qu¸n", {0, 108, 918, 1, 5, 1}, 2 },
        {"Hång ¶nh Tr©m", {0, 108, 919, 1, 5, 1}, 3 },
        {"Hång ¶nh Tr©m", {0, 108, 920, 1, 5, 1}, 4 },

        {"Hång ¶nh Y", {0, 109, 917, 1, 5, 1}, 1 },
        {"Hång ¶nh Y", {0, 109, 918, 1, 5, 1}, 2 },
        {"Hång ¶nh Y", {0, 109, 919, 1, 5, 1}, 3 },
        {"Hång ¶nh Y", {0, 109, 920, 1, 5, 1}, 4 },

        {"Hång ¶nh Trang", {0, 110, 917, 1, 5, 1}, 1 },
        {"Hång ¶nh Trang", {0, 110, 918, 1, 5, 1}, 2 },
        {"Hång ¶nh Trang", {0, 110, 919, 1, 5, 1}, 3 },
        {"Hång ¶nh Trang", {0, 110, 920, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31390)] = {
        {"C¬ Linh Qu¸n", {0, 108, 897, 1, 5, 1}, 1 },
        {"C¬ Linh Qu¸n", {0, 108, 898, 1, 5, 1}, 2 },
        {"C¬ Linh Tr©m", {0, 108, 899, 1, 5, 1}, 3 },
        {"C¬ Linh Tr©m", {0, 108, 900, 1, 5, 1}, 4 },

        {"C¬ Linh Y", {0, 109, 897, 1, 5, 1}, 1 },
        {"C¬ Linh Y", {0, 109, 898, 1, 5, 1}, 2 },
        {"C¬ Linh Y", {0, 109, 899, 1, 5, 1}, 3 },
        {"C¬ Linh Y", {0, 109, 900, 1, 5, 1}, 4 },

        {"C¬ Linh Trang", {0, 110, 897, 1, 5, 1}, 1 },
        {"C¬ Linh Trang", {0, 110, 898, 1, 5, 1}, 2 },
        {"C¬ Linh QuÇn", {0, 110, 899, 1, 5, 1}, 3 },
        {"C¬ Linh QuÇn", {0, 110, 900, 1, 5, 1}, 4 },
    },

    --LongDaiKa: thªm ngo¹i trang thiÕu
    [PackItemId(2,1,31537)] = {
        {"S­¬ng Khinh Qu¸n", {0, 108, 1109, 1, 5, 1}, 1 },
        {"S­¬ng Khinh Qu¸n", {0, 108, 1110, 1, 5, 1}, 2 },
        {"S­¬ng Khinh Tr©m", {0, 108, 1111, 1, 5, 1}, 3 },
        {"S­¬ng Khinh Tr©m", {0, 108, 1112, 1, 5, 1}, 4 },
        {"S­¬ng Khinh Y", {0, 109, 1109, 1, 5, 1}, 1 },
        {"S­¬ng Khinh Y", {0, 109, 1110, 1, 5, 1}, 2 },
        {"S­¬ng Khinh Y", {0, 109, 1111, 1, 5, 1}, 3 },
        {"S­¬ng Khinh Y", {0, 109, 1112, 1, 5, 1}, 4 },
        {"S­¬ng Khinh Trang", {0, 110, 1109, 1, 5, 1}, 1 },
        {"S­¬ng Khinh Trang", {0, 110, 1110, 1, 5, 1}, 2 },
        {"S­¬ng Khinh Trang", {0, 110, 1111, 1, 5, 1}, 3 },
        {"S­¬ng Khinh Trang", {0, 110, 1112, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31538)] = {
        {"Yªn Minh Qu¸n", {0, 108, 1113, 1, 5, 1}, 1 },
        {"Yªn Minh Qu¸n", {0, 108, 1114, 1, 5, 1}, 2 },
        {"Yªn Minh Tr©m", {0, 108, 1115, 1, 5, 1}, 3 },
        {"Yªn Minh Tr©m", {0, 108, 1116, 1, 5, 1}, 4 },
        {"Yªn Minh Y", {0, 109, 1113, 1, 5, 1}, 1 },
        {"Yªn Minh Y", {0, 109, 1114, 1, 5, 1}, 2 },
        {"Yªn Minh Y", {0, 109, 1115, 1, 5, 1}, 3 },
        {"Yªn Minh Y", {0, 109, 1116, 1, 5, 1}, 4 },
        {"Yªn Minh Trang", {0, 110, 1113, 1, 5, 1}, 1 },
        {"Yªn Minh Trang", {0, 110, 1114, 1, 5, 1}, 2 },
        {"Yªn Minh Trang", {0, 110, 1115, 1, 5, 1}, 3 },
        {"Yªn Minh Trang", {0, 110, 1116, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31362)] = {
        {"Vò Ch©u Qu¸n", {0, 108, 1033, 1, 5, 1}, 1 },
        {"Vò Ch©u Qu¸n", {0, 108, 1034, 1, 5, 1}, 2 },
        {"Vò Ch©u Tr©m", {0, 108, 1035, 1, 5, 1}, 3 },
        {"Vò Ch©u Tr©m", {0, 108, 1036, 1, 5, 1}, 4 },
        {"Vò Ch©u Y", {0, 109, 1033, 1, 5, 1}, 1 },
        {"Vò Ch©u Y", {0, 109, 1034, 1, 5, 1}, 2 },
        {"Vò Ch©u Y", {0, 109, 1035, 1, 5, 1}, 3 },
        {"Vò Ch©u Y", {0, 109, 1036, 1, 5, 1}, 4 },
        {"Vò Ch©u Trang", {0, 110, 1033, 1, 5, 1}, 1 },
        {"Vò Ch©u Trang", {0, 110, 1034, 1, 5, 1}, 2 },
        {"Vò Ch©u Trang", {0, 110, 1035, 1, 5, 1}, 3 },
        {"Vò Ch©u Trang", {0, 110, 1036, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31371)] = {
        {"B¹ch Sa Qu¸n", {0, 108, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Qu¸n", {0, 108, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Tr©m", {0, 108, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Tr©m", {0, 108, 1076, 1, 5, 1}, 4 },
        {"B¹ch Sa Y", {0, 109, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Y", {0, 109, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Y", {0, 109, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Y", {0, 109, 1076, 1, 5, 1}, 4 },
        {"B¹ch Sa Trang", {0, 110, 1073, 1, 5, 1}, 1 },
        {"B¹ch Sa Trang", {0, 110, 1074, 1, 5, 1}, 2 },
        {"B¹ch Sa Trang", {0, 110, 1075, 1, 5, 1}, 3 },
        {"B¹ch Sa Trang", {0, 110, 1076, 1, 5, 1}, 4 },
    },
    [PackItemId(2,1,31372)] = {
        {"Mai LiÔu Qu¸n", {0, 108, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Qu¸n", {0, 108, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Tr©m", {0, 108, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Tr©m", {0, 108, 1080, 1, 5, 1}, 4 },
        {"Mai LiÔu Y", {0, 109, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Y", {0, 109, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Y", {0, 109, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Y", {0, 109, 1080, 1, 5, 1}, 4 },
        {"Mai LiÔu Trang", {0, 110, 1077, 1, 5, 1}, 1 },
        {"Mai LiÔu Trang", {0, 110, 1078, 1, 5, 1}, 2 },
        {"Mai LiÔu Trang", {0, 110, 1079, 1, 5, 1}, 3 },
        {"Mai LiÔu Trang", {0, 110, 1080, 1, 5, 1}, 4 },
    },
    [PackItemId(2, 1, 31595)] = { -- Tói Ngo¹i Trang Quúnh QuÕ
        {"Quúnh QuÕ Qu¸n", {0, 108, 1121, 1, 5, 1}, 1 },
        {"Quúnh QuÕ Qu¸n", {0, 108, 1122, 1, 5, 1}, 2 },
        {"Quúnh QuÕ Tr©m", {0, 108, 1123, 1, 5, 1}, 3 },
        {"Quúnh QuÕ Tr©m", {0, 108, 1124, 1, 5, 1}, 4 },
        {"Quúnh QuÕ Y", {0, 109, 1121, 1, 5, 1}, 1 },
        {"Quúnh QuÕ Y", {0, 109, 1122, 1, 5, 1}, 2 },
        {"Quúnh QuÕ Y", {0, 109, 1123, 1, 5, 1}, 3 },
        {"Quúnh QuÕ Y", {0, 109, 1124, 1, 5, 1}, 4 },
        {"Quúnh QuÕ Trang", {0, 110, 1121, 1, 5, 1}, 1 },
        {"Quúnh QuÕ Trang", {0, 110, 1122, 1, 5, 1}, 2 },
        {"Quúnh QuÕ Trang", {0, 110, 1123, 1, 5, 1}, 3 },
        {"Quúnh QuÕ Trang", {0, 110, 1124, 1, 5, 1}, 4 },
    },
}

function OnUse(nIndex)
	return OnUseReal(nIndex)
end

function OnUseReal(nIndex, bSure)
	local g,d,p = GetItemInfoByIndex(nIndex)
	local t = tBoxes[PackItemId(g,d,p)]
	if t then
        --´º½Ú»î¶¯Íâ×°ÌØÊâ´¦Àí
        if bSure ~= 1 then
            local nTicketNum = 0
            if p == 31286 then
                nTicketNum = 20
            elseif p == 31289
                or p == 31290
                or p == 31291 then

                nTicketNum = 10
            end

            if nTicketNum > 0 then
                Say(format("Chän vËt phÈm:"), 
                    3,
                    format("§æi Ngo¹i Trang/#OnUseReal(%d, 1)", nIndex), 
                    format("§æi  thµnh %d %s/#convert_to_ticket(%d,%d)", nTicketNum, GetItemName(2,1,31320), nIndex, nTicketNum),
                    "Hñy bá/nothing");
                return
            end
        end

		return give_item_by_body(nIndex, t)
	end
end

function convert_to_ticket(nIndex, nTicketNum)
    if gf_JudgeRoomWeight(1, 0, 1) ~= 1 then
        return 0
    end
    if DelItemByIndex(nIndex, 1) ~= 1 then
        Talk(1, "", "Më Tói Ngo¹i Trang thÊt b¹i")
        return 0
    end

    local nRet, nItemIdx = gf_AddItemEx({2,1,31320, nTicketNum, 4}, GetItemName(2,1,31320))
    return nRet
end

function give_item_by_body(nPackIndex, tItems)
    local nRoom = floor(getn(tItems) / 4)
	if gf_JudgeRoomWeight(nRoom, nRoom*100, 1) ~= 1 then
		return 0
	end
	if DelItemByIndex(nPackIndex, 1) ~= 1 then
		Talk(1, "", "Më Tói Ngo¹i Trang thÊt b¹i")
		return 0
	end
	local nRet = 0
	for i = 1, getn(tItems) do
		local t = tItems[i]
		local szName, tPara, nNeedBody = unpack(t)
		if GetBody() == nNeedBody then
			local g,d,p,n,s,bind = unpack(tPara)
			local _,nIndex = AddItem(g,d,p,n,s)
            -- µ¥¶ÀÕë¶Ô±ùÄñÉèÖÃÊ±¼äÏŞÖÆ
            if (g == 0) and (d>=119 and d<=121) and (p>=255 and p<=258)then
                SetItemExpireTime(nIndex,7*24*3600)
            end

			if nIndex > 0 and bind == 1 then
				SetItemStatus(nIndex, 1, 1)
			end
			nRet = nRet + 1
		end
	end
	return nRet
end
