-- ====================== ÎÄ¼þÐÅÏ¢ ====================== 
                                                          
-- ½£ÏÀÇéÔµonlineII ¶þ¼¶É±ÊÖ°ü¹ü½Å±¾                  
-- Edited by Starry                                 
-- 2005/12/5 PM 14:09                                    
                                                          
-- ======================================================
function OnUse()

local i = 0;
local j = 0;
local k = 0; 
local nCount = 0;
local nLuckyNum = 0;
local nNum = 0; 

	----VËt phÈm t¹m ®ãng
	do	Talk(1,"","V©t phÈm t¹m thêi kh«ng thÓ sö dông!")	return end
	--------------------
	if DelItem(2,1,206,1) ~= 1 then
		return 0
	end
	
	--100%³ö¸ß¼¶Ò©Æ·:3¸ö¾Å×ª
	--AddItem(1,0,32,3,1);
	
	--50%³ö½ðÎý
	if random(1,100) <= 50 then
		AddItem(2,1,149,1,1);
	end;
	
	--50%³öÔÉÌú
	if random(1,100) <= 50 then
		AddItem(2,2,8,1,1);
	end;
	
	--50%³öÔÉÌúËéÆ¬
	if random(1,100) <= 50 then
		AddItem(2,2,7,1,1);
	end;
		
	--50%³öÐ¡¿é½ðÎý
	if random(1,100) <= 50 then
		AddItem(2,1,148,1,1);
	end;
	
	--14%³öÉñÃØÎïÆ·
	if random(1,100) <= 14 then
		local m = random(1,getn(SecretItem));
			AddItem(SecretItem[m][1],SecretItem[m][2],SecretItem[m][3],1,1);
	end; 
	
	--7.4%³öÌ××°Ã±×Ó
	nNum = random(1,1000);
	
	if nNum <= 74 then
	local nRoute = GetPlayerRoute();
	local nbody = GetBody()  

			AddItem(SuitData[nRoute][nbody][1],SuitData[nRoute][nbody][2],SuitData[nRoute][nbody][3],1,1,-1,-1,-1,-1,-1,-1);
		
		return
	end;
		
	--12.9%³ö¶¨ÖÆ×°±¸
	if nNum <= 203 then
	
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
		end;
		
		nLuckyNum = random(1,nCount);
		nCount = 0;
		
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
			if nCount>=nLuckyNum then
				k = getn(KillerBagData[i]);
				j = random(2,k);
				return AddItem(KillerBagData[i][j][1],KillerBagData[i][j][2],KillerBagData[i][j][3],KillerBagData[i][j][4],KillerBagData[i][j][5],KillerBagData[i][j][6],KillerBagData[i][j][7],KillerBagData[i][j][8],KillerBagData[i][j][9],KillerBagData[i][j][10],KillerBagData[i][j][11]);					
			end;
		end;
	end;
	
end;

KillerBagData = {
	--5¼¶»¤Éí,5¼¶½äÖ¸:¾­ÑéÌá¸ß2%;
	[1] = {14,{0,102,5,1,1,2,99,0,0,0,0},{0,102,15,1,1,2,99,0,0,0,0}},
	--5¼¶»¤Éí,5¼¶½äÖ¸:¼õÐèÇó2
	[2] = {29,{0,102,5,1,1,2,109,0,0,0,0},{0,102,15,1,1,2,109,0,0,0,0}},
	--60¼¶ÎäÆ÷,5¼¶»¤Éí,5¼¶½äÖ¸:Á¦Á¿13	¸ù¹Ç13	Éí·¨13;ÄÚ¹¦13	¸ù¹Ç13	¶´²ì13;¶´²ì13	Éí·¨13	¸ù¹Ç13
	[3] = {51,{0,102,5,1,1,5,95,5,94,5,96},
						{0,102,15,1,1,5,95,5,94,5,96},
						{0,102,5,1,1,5,98,5,94,5,97},
						{0,102,15,1,1,5,98,5,94,5,97},
						{0,102,5,1,1,5,97,5,96,5,94},
						{0,102,15,1,1,5,97,5,96,5,94},
						{0,0,11,1,1,3,86,5,98,3,64},
						{0,2,24,1,1,3,86,5,98,3,64},
						{0,0,11,1,1,3,85,5,95,3,63},
						{0,1,50,1,1,3,85,5,96,3,63},
						{0,9,83,1,1,3,85,5,97,3,63},
						{0,2,24,1,1,6,42,5,98,2,99},
						{0,10,72,1,1,3,86,5,98,3,64},
						{0,8,94,1,1,3,86,5,98,3,64},
						{0,5,37,1,1,3,85,5,95,3,63},
						{0,3,61,1,1,3,85,5,95,3,63},
						{0,6,105,1,1,3,85,4,95,2,63},
						{0,4,116,1,1,3,85,4,96,2,63},
						{0,11,9,1,1,3,86,5,98,3,64},
						{0,7,9,1,1,3,85,5,96,3,63},
						}
	}

SuitData = {

	--½ð¸ÕÖ®³¯Ñô¹Ú(ÉÙÁÖË×¼Ò)
	[2] = {{0,103,251},{0,103,252}},
	--ÈçÀ´Ö®³¯Ñô¹Ú(ÉÙÁÖìø×Ú)
	[3] = {{0,103,351},{0,103,352}},
	--ÂÞººÖ®³¯Ñô¹Ú(ÉÙÁÖÎä×Ú)
	[4] = {{0,103,451},{0,103,452}},
	--ÏÀ¿ÍÖ®³¯Ñô¹Ú(ÌÆÃÅ)
	[6] = {{0,103,651},{0,103,652},{0,103,653},{0,103,654}},
	--¹ÛÒôÖ®³¯Ñô¹Ú(¶ëáÒ·ð¼Ò)
	[8] = {{},{},{0,103,853},{0,103,854}},
	--ÓñÅ®Ö®³¯Ñô¹Ú(¶ëáÒË×¼Ò)
	[9] = {{},{},{0,103,953},{0,103,954}}, 
	--½µÁúÖ®³¯Ñô¹Ú(Ø¤°ï¾»ÒÂ)
	[11] = {{0,103,1151},{0,103,1152},{0,103,1153},{0,103,1154}},
	--·èÄ§Ö®³¯Ñô¹Ú(Ø¤°ïÎÛÒÂ)
	[12] = {{0,103,1251},{0,103,1252},{0,103,1253},{0,103,1254}},
	--ÕæÎäÖ®³¯Ñô¹Ú(Îäµ±µÀ¼Ò)
	[14] = {{0,103,1451},{0,103,1452},{0,103,1453},{0,103,1454}},
	--Ò»ÑôÖ®³¯Ñô¹Ú(Îäµ±Ë×¼Ò)
	[15] = {{0,103,1551},{0,103,1552},{0,103,1553},{0,103,1554}},
	--³µÆïÖ®Õ½Ê¿¹Ú(ÑîÃÅÇ¹Æï)
	[17] = {{0,103,1751},{0,103,1752},{0,103,1753},{0,103,1754}},
	--ÑïÍþÖ®¶¨¹ú¹Ú(ÑîÃÅ¹­Æï)
	[18] = {{0,103,1851},{0,103,1852},{0,103,1853},{0,103,1854}},
	--ÓÄççÖ®Á÷ÔÆ¹Ú(Îå¶¾Ð°ÏÀ)
	[20] = {{0,103,2051},{0,103,2052},{0,103,2053},{0,103,2054}},
	--ÃçÃÅÖ®Î×¹Æ¹Ú(Îå¶¾¹ÆÊ¦)
	[21] = {{0,103,2151},{0,103,2152},{0,103,2153},{0,103,2154}},
}

SecretItem = {
	--Áú¹Ç
	[1] = {2,1,116},
	--Ê¬ÍõÀß¹Ç
	[2] = {2,1,118},
	--²ÔÀÇÑÀ
	[3] = {2,1,113},
	--À×Ñ×½ðÉ³
	[4] = {2,1,146},
	--·ÀË®ÓÍ³ñ
	[5] = {2,1,114},
	--ÌìÒÂÎÞ·ì
	[6] = {2,1,147},
	--Ä«ÓÍ
	[7] = {2,1,136},
	--È¾ÁÏ
	[8] = {2,1,153},		
}
