-- ====================== ÎÄ¼şĞÅÏ¢ ====================== 
                                                          
-- ½£ÏÀÇéÔµonlineII Ò»µÈÉ±ÊÖ°ü¹ü½Å±¾                  
-- Edited by Starry                                 
-- 2005/12/5 PM 14:09                                    
                                                          
-- ======================================================
function OnUse()

local i = 0;
local j = 0;
local k = 0; 
local nCount = 0;
local nLuckyNum = 0;
local nNum = 0; 

	----VËt phÈm t¹m ®ãng
	do	Talk(1,"","V©t phÈm t¹m thêi kh«ng thÓ sö dông!")	return end
	--------------------
	if DelItem(2,1,205,1) ~= 1 then
		return 0
	end
	
	--100%³ö¸ß¼¶Ò©Æ·:3¸ö¾Å×ª
	--AddItem(1,0,32,3,1);
	
	--50%³ö½ğÎı
	if random(1,100) <= 50 then
		AddItem(2,1,149,1,1);
	end;
	
	--50%³öÔÉÌú
	if random(1,100) <= 50 then
		AddItem(2,2,8,1,1);
	end;
	
	--50%³öÔÉÌúËéÆ¬
	if random(1,100) <= 50 then
		AddItem(2,2,7,1,1);
	end;
		
	--50%³öĞ¡¿é½ğÎı
	if random(1,100) <= 50 then
		AddItem(2,1,148,1,1);
	end;
	
	--14%³öÉñÃØÎïÆ·
	if random(1,100) <= 14 then
		local m = random(1,getn(SecretItem));
			AddItem(SecretItem[m][1],SecretItem[m][2],SecretItem[m][3],1,1);
	end; 
	
	--7.4%³öÌ××°Ã±×Ó
	nNum = random(1,1000);
	
	if nNum <= 74 then
	local nRoute = GetPlayerRoute();
	local nbody = GetBody()

		AddItem(SuitData[nRoute][nbody][1],SuitData[nRoute][nbody][2],SuitData[nRoute][nbody][3],1,1,-1,-1,-1,-1,-1,-1);
	
		return
	end;
		
	--12.9%³ö¶¨ÖÆ×°±¸
	if nNum <= 203 then
	
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
		end;
		
		nLuckyNum = random(1,nCount);
		nCount = 0;
		
		for i=1,getn(KillerBagData) do
			nCount = nCount + KillerBagData[i][1];
			if nCount>=nLuckyNum then
				k = getn(KillerBagData[i]);
				j = random(2,k);
				return AddItem(KillerBagData[i][j][1],KillerBagData[i][j][2],KillerBagData[i][j][3],KillerBagData[i][j][4],KillerBagData[i][j][5],KillerBagData[i][j][6],KillerBagData[i][j][7],KillerBagData[i][j][8],KillerBagData[i][j][9],KillerBagData[i][j][10],KillerBagData[i][j][11]);					
			end;
		end;
	end;
	
end;

KillerBagData = {
	--5¼¶»¤Éí,5¼¶½äÖ¸:¾­ÑéÌá¸ß3%;
	[1] = {14,{0,102,5,1,1,2,99,0,0,0,0},{0,102,15,1,1,2,99,0,0,0,0}},
	--5¼¶»¤Éí,5¼¶½äÖ¸:¼õĞèÇó1
	[2] = {29,{0,102,5,1,1,2,109,0,0,0,0},{0,102,15,1,1,2,109,0,0,0,0}},
	--70¼¶ÎäÆ÷,5¼¶»¤Éí,5¼¶½äÖ¸:Á¦Á¿13	¸ù¹Ç13	Éí·¨13;ÄÚ¹¦13	¸ù¹Ç13	¶´²ì13;¶´²ì13	Éí·¨13	¸ù¹Ç13
	[3] = {51,{0,102,5,1,1,5,95,5,94,5,96},
						{0,102,15,1,1,5,95,5,94,5,96},
						{0,102,5,1,1,5,98,5,94,5,97},
						{0,102,15,1,1,5,98,5,94,5,97},
						{0,102,5,1,1,5,97,5,96,5,94},
						{0,102,15,1,1,5,97,5,96,5,94},
						{0,0,13,1,1,3,86,5,98,4,64},
						{0,2,26,1,1,3,86,5,98,4,64},
						{0,0,13,1,1,3,85,5,95,4,63},
						{0,1,52,1,1,3,85,5,96,4,63},
						{0,9,85,1,1,3,85,5,97,4,63},
						{0,2,26,1,1,6,42,5,98,2,99},
						{0,10,74,1,1,3,86,5,98,4,64},
						{0,8,96,1,1,3,86,5,98,4,64},
						{0,5,39,1,1,3,85,5,95,4,63},
						{0,3,63,1,1,3,85,5,95,4,63},
						{0,6,107,1,1,3,85,5,95,4,63},
						{0,4,118,1,1,3,85,5,96,4,63},
						{0,11,11,1,1,3,86,5,98,4,64},
						{0,7,11,1,1,3,85,5,96,4,63},
						}
}

SuitData = {

	--½ğ¸ÕÖ®åĞÒ£¹Ú(ÉÙÁÖË×¼Ò)
	[2] = {{0,103,271},{0,103,272}},
	--ÈçÀ´Ö®åĞÒ£¹Ú(ÉÙÁÖìø×Ú)
	[3] = {{0,103,371},{0,103,372}},
	--ÂŞººÖ®åĞÒ£¹Ú(ÉÙÁÖÎä×Ú)
	[4] = {{0,103,471},{0,103,472}},
	--ÏÀ¿ÍÖ®åĞÒ£¹Ú(ÌÆÃÅ)
	[6] = {{0,103,671},{0,103,672},{0,103,673},{0,103,674}},
	--¹ÛÒôÖ®åĞÒ£¹Ú(¶ëáÒ·ğ¼Ò)
	[8] = {{},{},{0,103,873},{0,103,874}},
	--ÓñÅ®Ö®åĞÒ£¹Ú(¶ëáÒË×¼Ò)
	[9] = {{},{},{0,103,973},{0,103,974}}, 
	--½µÁúÖ®åĞÒ£¹Ú(Ø¤°ï¾»ÒÂ)
	[11] = {{0,103,1171},{0,103,1172},{0,103,1173},{0,103,1174}},
	--·èÄ§Ö®åĞÒ£¹Ú(Ø¤°ïÎÛÒÂ)
	[12] = {{0,103,1271},{0,103,1272},{0,103,1273},{0,103,1274}},
	--ÕæÎäÖ®åĞÒ£¹Ú(Îäµ±µÀ¼Ò)
	[14] = {{0,103,1471},{0,103,1472},{0,103,1473},{0,103,1474}},
	--Ò»ÑôÖ®åĞÒ£¹Ú(Îäµ±Ë×¼Ò)
	[15] = {{0,103,1571},{0,103,1572},{0,103,1573},{0,103,1574}},
	--³µÆïÖ®½«¾ü¹Ú(ÑîÃÅÇ¹Æï)
	[17] = {{0,103,1771},{0,103,1772},{0,103,1773},{0,103,1774}},
	--ÑïÍşÖ®°²°î¹Ú(ÑîÃÅ¹­Æï)
	[18] = {{0,103,1871},{0,103,1872},{0,103,1873},{0,103,1874}},
	--ÓÄÚ¤Ö®Ç§¾û¹Ú(Îå¶¾Ğ°ÏÀ)
	[20] = {{0,103,2071},{0,103,2072},{0,103,2073},{0,103,2074}},
	--ÃçÃÅÖ®Ê´ĞÄ¹Ú(Îå¶¾¹ÆÊ¦)
	[21] = {{0,103,2171},{0,103,2172},{0,103,2173},{0,103,2174}},
}

SecretItem = {
	--Áú¹Ç
	[1] = {2,1,116},
	--Ê¬ÍõÀß¹Ç
	[2] = {2,1,118},
	--²ÔÀÇÑÀ
	[3] = {2,1,113},
	--À×Ñ×½ğÉ³
	[4] = {2,1,146},
	--·ÀË®ÓÍ³ñ
	[5] = {2,1,114},
	--ÌìÒÂÎŞ·ì
	[6] = {2,1,147},
	--Ä«ÓÍ
	[7] = {2,1,136},
	--È¾ÁÏ
	[8] = {2,1,153},		
}
