QHT_TRIGGER_6021_TABLE = {
	{1, 64, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	{31, 3, "qht_create_shengtan(6021,1)", ""},
	{31, 2, "qht_create_shengtan(6021,2)", ""},
	{31, 1, "qht_create_shengtan(6021,3)", ""},
	{31, 15, "qht_create_languai()", ""},
	{31, 5, "qht_create_diji_box()", ""},
	{31, 10, "qht_create_xiaoboss()", ""},
}

QHT_TRIGGER_6022_TABLE = {
	{1, 64, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	{31, 3, "qht_create_shengtan(6022,1)", ""},
	{31, 2, "qht_create_shengtan(6022,2)", ""},
	{31, 1, "qht_create_shengtan(6022,3)", ""},
	{31, 8, "qht_create_diji_box()", ""},
	{31, 12, "qht_create_xiaoboss()", ""},
	{31, 2, "qht_create_zhongji_box()", ""},
	{31, 8, "qht_create_zhongboss()", ""},
}

QHT_TRIGGER_6023_TABLE = {
	{1, 7200, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	{31, 300, "qht_create_shengtan(6023,1)", ""},
	{31, 200, "qht_create_shengtan(6023,2)", ""},
	{31, 100, "qht_create_shengtan(6023,3)", ""},
	{31, 400, "qht_create_zhongji_box()", ""},
	{31, 400, "qht_create_zhongboss()", ""},
	{31, 300, "qht_create_gaoji_box()", ""},
	{31, 100, "qht_create_daboss()", ""},
	{31, 1000, "nothing()", ""},
	--{31, 0, "qht_create_goldboss()", ""},
}

--½±Àø×é1£¬µÍ¼¶±¦Ïä
QHT_AWARD_PERSONAL_1 = {
	{31, 2275, "qht_add_zhenqi(10)", ""},
	{31, 1875, "qht_add_xiuwei(3)", ""},
	{31, 1875, "qht_add_shengwang(1)", ""},
	{31, 1875, "qht_add_shimen(1)", ""},
	{1, 2000, "Cæ Linh Th¹ch", {2, 1, 30368, 1}, 0},
	{31, 100, "qht_award_jinwenhufu(1,100,100)", ""},
}

QHT_AWARD_THROW_DICE1 = {
	{1, 94500, "ThiÕt Tinh cÊp 1", {2, 1, 30533, 1, 4}, 0},
	{1, 500, "Cæ Linh Ngäc", {2, 1, 30369, 1}, 0},
	{1, 2000, "CÊp 1 LuyÖn L« ThiÕt", {2, 1, 30527, 1, 4}, 0},
	{1, 2000, "CÊp 1 TÈy T©m Th¹ch", {2, 1, 30521, 1, 4}, 0},
	{1, 125, "HuyÕtTrÝchTh¹ch Lv1", {2, 22, 101, 1}, 0},
	{1, 125, "NguyÖtB¹chTh¹ch Lv1", {2, 22, 201, 1}, 0},
	{1, 125, "Hæ Ph¸ch Th¹ch CÊp 1", {2, 22, 301, 1}, 0},
	{1, 125, "H¾c DiÖu Th¹ch CÊp 1", {2, 22, 401, 1}, 0},
	{31, 500, "qht_award_jinwenhufu(1,100,100)", ""},
	--{31, 5000, "nothing()", ""},
}

--½±Àø×é2£¬ÖÐ¼¶±¦Ïä
QHT_AWARD_PERSONAL_2 = {
	{31, 1375, "qht_add_zhenqi(20)", ""},
	{31, 1375, "qht_add_xiuwei(6)", ""},
	{31, 1375, "qht_add_shengwang(2)", ""},
	{31, 1375, "qht_add_shimen(2)", ""},
	{1, 1000, "Linh Th¹ch Nguyªn Th¹ch cÊp 1", {2, 1, 30413, 1}, 0},
	{1, 1000, "Linh Th¹ch Nguyªn Th¹ch cÊp 2", {2, 1, 30414, 1}, 0},
	{1, 500, "Linh Th¹ch Nguyªn Th¹ch cÊp 3", {2, 1, 30415, 1}, 0},
	{1, 900, "Cæ Linh Th¹ch", {2, 1, 30368, 5}, 0},
	{1, 1000, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 1}, 0},
	{31, 100, "qht_award_jinwenhufu(1,100,100)", ""},
}


QHT_AWARD_THROW_DICE2 = {
	{1, 2300, "TÈy T©m Th¹ch Kho¸ng", {2, 1, 30536, 1}, 0},
	{1, 2000, "LuyÖn L« ThiÕt Kho¸ng", {2, 1, 30537, 1}, 0},
	{1, 3100, "ThiÕt Tinh cÊp 1", {2, 1, 30533, 1, 4}, 0},
	{1, 200, "Cæ Linh Ngäc", {2, 1, 30369, 1}, 0},
	{1, 500, "CÊp 1 LuyÖn L« ThiÕt", {2, 1, 30527, 1, 4}, 0},
	{1, 500, "CÊp 1 TÈy T©m Th¹ch", {2, 1, 30521, 1, 4}, 0},
	{1, 1000, "ThiÕt Tinh cÊp 2", {2, 1, 30534, 1, 4}, 0},
	{1, 100, "CÊp 2 LuyÖn L« ThiÕt", {2, 1, 30528, 1, 4}, 0},
	{1, 100, "CÊp 2 TÈy T©m Th¹ch", {2, 1, 30522, 1, 4}, 0},
	{31, 100, "qht_award_jinwenhufu(1,100,100)", ""},
	{1, 25, "HuyÕtTrÝchTh¹ch Lv1", {2, 22, 101, 1}, 0},
	{1, 25, "NguyÖtB¹chTh¹ch Lv1", {2, 22, 201, 1}, 0},
	{1, 25, "Hæ Ph¸ch Th¹ch CÊp 1", {2, 22, 301, 1}, 0},
	{1, 25, "H¾c DiÖu Th¹ch CÊp 1", {2, 22, 401, 1}, 0},
}

--½±Àø×é3£¬¸ß¼¶±¦Ïä
QHT_AWARD_PERSONAL_3 = {
	{31, 1500, "qht_add_zhenqi(60)", ""},
	{31, 1500, "qht_add_xiuwei(12)", ""},
	{31, 1500, "qht_add_shengwang(4)", ""},
	{31, 1500, "qht_add_shimen(4)", ""},
	{1, 1400, "Cæ Linh Th¹ch", {2, 1, 30368, 5}, 0},
	--{1, 100, "¹ÅÁéÓñ", {2, 1, 30369, 1}, 0},
	{1, 800, "Linh Th¹ch Nguyªn Th¹ch cÊp 3", {2, 1, 30415, 1}, 0},
	{1, 500, "Linh Th¹ch Nguyªn Th¹ch cÊp 4", {2, 1, 30416, 1}, 0},
	{1, 200, "Linh Th¹ch Nguyªn Th¹ch cÊp 5", {2, 1, 30417, 1}, 0},
	{1, 300, "Ma §ao Th¹ch cÊp 1", {2, 1, 30428, 1}, 0},
	{1, 300, "Tói tiÒn", {2, 1, 30367, 1}, 0},
	{1, 500, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 5}, 0},
}

QHT_AWARD_THROW_DICE3 = {
	{1, 25, "ThiÕt Tinh cÊp 1", {2, 1, 30533, 1, 4}, 0},
	{1, 12, "CÊp 1 LuyÖn L« ThiÕt", {2, 1, 30527, 1, 4}, 0},
	{1, 13, "CÊp 1 TÈy T©m Th¹ch", {2, 1, 30521, 1, 4}, 0},
	{1, 10, "TÈy T©m Th¹ch Kho¸ng", {2, 1, 30536, 1}, 0},
	{1, 10, "LuyÖn L« ThiÕt Kho¸ng", {2, 1, 30537, 1}, 0},
	{1, 10, "ThiÕt Tinh cÊp 2", {2, 1, 30534, 1, 4}, 0},
	{1, 1, "Cæ Linh Ngäc", {2, 1, 30369, 1}, 0},
	{1, 3, "CÊp 2 LuyÖn L« ThiÕt", {2, 1, 30528, 1, 4}, 0},
	{1, 3, "CÊp 2 TÈy T©m Th¹ch", {2, 1, 30522, 1, 4}, 0},
	{1, 3, "HuyÕtTrÝchTh¹ch Lv1", {2, 22, 101, 1}, 0},
	{1, 3, "NguyÖtB¹chTh¹ch Lv1", {2, 22, 201, 1}, 0},
	{1, 3, "Hæ Ph¸ch Th¹ch CÊp 1", {2, 22, 301, 1}, 0},
	{1, 3, "H¾c DiÖu Th¹ch CÊp 1", {2, 22, 401, 1}, 0},
	{31, 1, "qht_award_jinwenhufu(1,100,100)", ""},
}

--½±Àø×é4£¬´óBOSS
QHT_AWARD_PERSONAL_4 = {
	{31, 1500, "qht_add_zhenqi(100)", ""},
	{31, 1500, "qht_add_xiuwei(24)", ""},
	{31, 1500, "qht_add_shengwang(8)", ""},
	{31, 1500, "qht_add_shimen(8)", ""},
	{1, 1000, "Cæ Linh Th¹ch", {2, 1, 30368, 10}, 0},
	--{1, 100, "¹ÅÁéÓñ", {2, 1, 30369, 5}, 0},
	{1, 1200, "Tói tiÒn", {2, 1, 30367, 1}, 0},
	{1, 500, "Linh Th¹ch Nguyªn Th¹ch cÊp 4", {2, 1, 30416, 1}, 0},
	{1, 200, "Linh Th¹ch Nguyªn Th¹ch cÊp 5", {2, 1, 30417, 1}, 0},
	{1, 100, "Linh Th¹ch Nguyªn Th¹ch cÊp 6", {2, 1, 30418, 1}, 0},
	{1, 1000, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 20}, 0},
}

QHT_AWARD_THROW_DICE4_1 = {
	--{1, 15, "ÎåÐÐ±¦Ïä", {2, 1, 30320, 1}, 0},
	--{1, 15, "ÌìÍâÁ÷ÐÇ", {2, 1, 30321, 1}, 0},
	{1, 25, "M¶nh Thiªn Cang", {2, 1, 30390, 1}, 0},
	{1, 5, "M¶nh Thiªn M«n", {2, 1, 30410, 1}, 0},
	--{1, 5, "ÔÉÌú", {2, 2, 8, 1}, 0},
	--{1, 5, "ÔÉÌúËéÆ¬", {2, 2, 7, 1}, 0},
	{1, 20, "ThiÕt Tinh cÊp 2", {2, 1, 30534, 1}, 0},
	{1, 15, "CÊp 2 TÈy T©m Th¹ch", {2, 1, 30522, 1}, 0},
	{1, 15, "CÊp 2 LuyÖn L« ThiÕt", {2, 1, 30528, 1}, 0},
	{1, 5, "Cæ Linh Ngäc", {2, 1, 30369, 1}, 0},
	{1, 5, "ThiÕt Tinh cÊp 3", {2, 1, 30535, 1}, 0},
	{1, 5, "CÊp 3 TÈy T©m Th¹ch", {2, 1, 30523, 1}, 0},
	{1, 5, "CÊp 3 LuyÖn L« ThiÕt", {2, 1, 30529, 1}, 0},
}
QHT_AWARD_THROW_DICE4_2 = {
--    {1, 15, "5¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30417, 1}, 0},
--    {1, 10, "6¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30418, 1}, 0},
--    {1, 5, "1¼¶Ä¥µ¶Ê¯", {2, 1, 30428, 1}, 0},
--    {1, 4, "2¼¶Ä¥µ¶Ê¯", {2, 1, 30429, 1}, 0},
--    {1, 3, "3¼¶Ä¥µ¶Ê¯", {2, 1, 30430, 1}, 0},
--    {1, 2, "12¼¶Ç¿»¯¾í", {2, 1, 30424, 1}, 0},
--    {1, 1, "13¼¶Ç¿»¯¾í", {2, 1, 30425, 1}, 0},
	{1, 25, "HuyÕtTrÝchTh¹ch Lv1", {2, 22, 101, 1}, 0},
	{1, 25, "NguyÖtB¹chTh¹ch Lv1", {2, 22, 201, 1}, 0},
	{1, 25, "Hæ Ph¸ch Th¹ch CÊp 1", {2, 22, 301, 1}, 0},
	{1, 25, "H¾c DiÖu Th¹ch CÊp 1", {2, 22, 401, 1}, 0},
--    {31, 60, "nothing()", ""},
}
QHT_AWARD_THROW_DICE4_3 = {
	--{31, 25, "qht_award_tianyi(%d)", ""},
	--{31, 10, "qht_award_ziyan(%d)", ""},
	--{31, 5, "qht_award_3_yunling(%d)", ""},
	--{31, 60, "nothing()", ""},
--	{1, 40, "3¼¶Ìú¾§", {2, 1, 30535, 1, 4}, 0},
--	{31, 40, "qht_award_jinwenhufu(1,100,100)", ""},
	--{1, 10, "²¼ÖÆ¸ßÍ²Ñ¥", {0,	154,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
	--{1, 10, "ÓñÖÆ»ÕÕÂ", {0,	153,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
	--{31, 5, "qht_award_wuxing_foot_3()", ""},
	--{31, 5, "qht_award_wuxing_badge_3()", ""},
--	{1, 5, "2¼¶ÑªµÎÊ¯", {2, 22, 102, 1}, 0},
--	{1, 5, "2¼¶ÔÂ°×Ê¯", {2, 22, 202, 1}, 0},
--	{1, 5, "2¼¶çúçêÊ¯", {2, 22, 302, 1}, 0},
--	{1, 5, "2¼¶ºÚê×Ê¯", {2, 22, 402, 1}, 0},
	--{31, 0, "nothing()", ""},
}

--½±Àø×é5£¬·ÏÆú
QHT_AWARD_THROW_DICE5_1 = {
--	{1, 60, "Ììî¸ËéÆ¬", {2, 1, 30390, 1}, 0},
--	{1, 30, "ÌìÃÅËéÆ¬", {2, 1, 30410, 1}, 0},
--	{1, 10, "°×½ðËéÆ¬", {2, 1, 30346, 1}, 0},
}
QHT_AWARD_THROW_DICE5_2 = {
--	{1, 16, "6¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30418, 1}, 0},
--	{1, 8, "7¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30419, 1}, 0},
--	{1, 6, "2¼¶Ä¥µ¶Ê¯", {2, 1, 30429, 1}, 0},
--	{1, 4, "3¼¶Ä¥µ¶Ê¯", {2, 1, 30430, 1}, 0},
--	{1, 3, "12¼¶Ç¿»¯¾í", {2, 1, 30424, 1}, 0},
--	{1, 2, "13¼¶Ç¿»¯¾í", {2, 1, 30425, 1}, 0},
--	{1, 1, "14¼¶Ç¿»¯¾í", {2, 1, 30426, 1}, 0},
--	{31, 60, "nothing()", ""},
}
QHT_AWARD_THROW_DICE5_3 = {
--		{31, 20, "qht_award_haoyue(%d)", ""},
--		{31, 10, "qht_award_3_yunling(%d)", ""},
--		{31, 5, "qht_award_tiangang(%d)", ""},
--		{31, 3, "qht_award_zuoji(%d)", ""},
--		{31, 2, "qht_award_tianmen(%d)", ""},
--		{31, 60, "nothing()", ""},
}

--½±Àø×é6£¬1²ã»Æ½ðBOSS
QHT_AWARD_THROW_DICE6_1 = {
--		{1, 45, "²¼ÖÆ¸ßÍ²Ñ¥", {0,	154,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--		{1, 45, "ÓñÖÆ»ÕÕÂ", {0,	153,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--		{31, 5, "qht_award_wuxing_foot_3()", ""},
--		{31, 5, "qht_award_wuxing_badge_3()", ""},
	{1, 25, "HuyÕtTrÝchTh¹ch Lv1", {2, 22, 101, 1}, 0},
	{1, 25, "NguyÖtB¹chTh¹ch Lv1", {2, 22, 201, 1}, 0},
	{1, 25, "Hæ Ph¸ch Th¹ch CÊp 1", {2, 22, 301, 1}, 0},
	{1, 25, "H¾c DiÖu Th¹ch CÊp 1", {2, 22, 401, 1}, 0},
}
QHT_AWARD_THROW_DICE6_2 = {
--	{1, 16, "6¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30418, 1}, 0},
--	{1, 8, "7¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30419, 1}, 0},
--	{1, 6, "2¼¶Ä¥µ¶Ê¯", {2, 1, 30429, 1}, 0},
--	{1, 4, "3¼¶Ä¥µ¶Ê¯", {2, 1, 30430, 1}, 0},
--	{1, 3, "12¼¶Ç¿»¯¾í", {2, 1, 30424, 1}, 0},
--	{1, 2, "13¼¶Ç¿»¯¾í", {2, 1, 30425, 1}, 0},
--	{1, 1, "14¼¶Ç¿»¯¾í", {2, 1, 30426, 1}, 0},
	{1, 1850, "HuyÕtTrÝchTh¹ch Lv2", {2, 22, 102, 1}, 0},
	{1, 1850, "NguyÖtB¹chTh¹ch Lv2", {2, 22, 202, 1}, 0},
	{1, 1850, "Hæ Ph¸ch Th¹ch CÊp 2", {2, 22, 302, 1}, 0},
	{1, 1850, "H¾c DiÖu Th¹ch CÊp 2", {2, 22, 402, 1}, 0},
	{1, 350, "HuyÕtTrÝchTh¹ch Lv3", {2, 22, 103, 1}, 0},
	{1, 350, "NguyÖtB¹chTh¹ch Lv3", {2, 22, 203, 1}, 0},
	{1, 350, "Hæ Ph¸ch Th¹ch CÊp 3", {2, 22, 303, 1}, 0},
	{1, 350, "H¾c DiÖu Th¹ch CÊp 3", {2, 22, 403, 1}, 0},
	{1, 45, "HuyÕtTrÝchTh¹ch Lv4", {2, 22, 104, 1}, 0},
	{1, 45, "NguyÖtB¹chTh¹ch Lv4", {2, 22, 204, 1}, 0},
	{1, 45, "Hæ Ph¸ch Th¹ch CÊp 4", {2, 22, 304, 1}, 0},
	{1, 45, "H¾c DiÖu Th¹ch CÊp 4", {2, 22, 404, 1}, 0},
	{31, 10, "qht_award_tianjiao(%d)", ""},
	{31, 5, "qht_award_tiangang(%d)", ""},
	{31, 5, "qht_award_tianmen(%d)", ""},
	{1, 600, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 50}, 0},
	{31, 200, "qht_award_heibao(%d)", ""},
	{31, 200, "qht_award_huangbao(%d)", ""},

	-- {1, 300, "ºÚ±ª×Ó±¦±¦", {0, 105, 30029, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	-- {1, 300, "»Æ±ª×Ó±¦±¦", {0, 105, 30030, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	--{31, 500, "nothing()", ""},
}

--½±Àø×é7£¬2²ã»Æ½ðBOSS
QHT_AWARD_THROW_DICE7_1 = {
		--{1, 60, "Ììî¸ËéÆ¬", {2, 1, 30390, 1}, 0},
    --{1, 30, "ÌìÃÅËéÆ¬", {2, 1, 30410, 1}, 0},
    --{1, 10, "°×½ðËéÆ¬", {2, 1, 30346, 1}, 0},
    {1, 100, "ChiÕn Kú Bang Ph¸i", {2, 1, 30573, 1, 4}, 12 * 3600},
}
QHT_AWARD_THROW_DICE7_2 = {
--	{1, 16, "6¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30418, 1}, 0},
--	{1, 8, "7¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30419, 1}, 0},
--	{1, 6, "2¼¶Ä¥µ¶Ê¯", {2, 1, 30429, 1}, 0},
--	{1, 4, "3¼¶Ä¥µ¶Ê¯", {2, 1, 30430, 1}, 0},
--	{1, 3, "12¼¶Ç¿»¯¾í", {2, 1, 30424, 1}, 0},
--	{1, 2, "13¼¶Ç¿»¯¾í", {2, 1, 30425, 1}, 0},
--	{1, 1, "14¼¶Ç¿»¯¾í", {2, 1, 30426, 1}, 0},
--	{1, 25, "²¼ÖÆ¸ßÍ²Ñ¥", {0,	154,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--	{1, 25, "ÓñÖÆ»ÕÕÂ", {0,	153,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--	{31, 5, "qht_award_wuxing_foot_3()", ""},
--	{31, 5, "qht_award_wuxing_badge_3()", ""},
--	{31, 60, "nothing()", ""},
	{1, 1850, "HuyÕtTrÝchTh¹ch Lv2", {2, 22, 102, 1}, 0},
	{1, 1850, "NguyÖtB¹chTh¹ch Lv2", {2, 22, 202, 1}, 0},
	{1, 1850, "Hæ Ph¸ch Th¹ch CÊp 2", {2, 22, 302, 1}, 0},
	{1, 1850, "H¾c DiÖu Th¹ch CÊp 2", {2, 22, 402, 1}, 0},
	{1, 350, "HuyÕtTrÝchTh¹ch Lv3", {2, 22, 103, 1}, 0},
	{1, 350, "NguyÖtB¹chTh¹ch Lv3", {2, 22, 203, 1}, 0},
	{1, 350, "Hæ Ph¸ch Th¹ch CÊp 3", {2, 22, 303, 1}, 0},
	{1, 350, "H¾c DiÖu Th¹ch CÊp 3", {2, 22, 403, 1}, 0},
	{1, 45, "HuyÕtTrÝchTh¹ch Lv4", {2, 22, 104, 1}, 0},
	{1, 45, "NguyÖtB¹chTh¹ch Lv4", {2, 22, 204, 1}, 0},
	{1, 45, "Hæ Ph¸ch Th¹ch CÊp 4", {2, 22, 304, 1}, 0},
	{1, 45, "H¾c DiÖu Th¹ch CÊp 4", {2, 22, 404, 1}, 0},
	{31, 10, "qht_award_tianjiao(%d)", ""},
	{31, 5, "qht_award_tiangang(%d)", ""},
	{31, 5, "qht_award_tianmen(%d)", ""},
	{1, 600, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 50}, 0},
	-- {1, 300, "ºÚ±ª×Ó±¦±¦", {0, 105, 30029, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	-- {1, 300, "»Æ±ª×Ó±¦±¦", {0, 105, 30030, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{31, 200, "qht_award_heibao(%d)", ""},
	{31, 200, "qht_award_huangbao(%d)", ""},
}

QHT_AWARD_THROW_DICE8_1 = {
--		{1, 60, "Ììî¸ËéÆ¬", {2, 1, 30390, 1}, 0},
--		{1, 30, "ÌìÃÅËéÆ¬", {2, 1, 30410, 1}, 0},
--		{1, 10, "°×½ðËéÆ¬", {2, 1, 30346, 1}, 0},
		{1, 100, "ChiÕn Kú Bang Ph¸i ThiÕt HuyÕt", {2, 1, 30574, 1, 4}, 12 * 3600},
}
QHT_AWARD_THROW_DICE8_2 = {
--		{1, 16, "6¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30418, 1}, 0},
--		{1, 8, "7¼¶ÁéÊ¯Ô­Ê¯", {2, 1, 30419, 1}, 0},
--		{1, 6, "2¼¶Ä¥µ¶Ê¯", {2, 1, 30429, 1}, 0},
--		{1, 4, "3¼¶Ä¥µ¶Ê¯", {2, 1, 30430, 1}, 0},
--		{1, 3, "13¼¶Ç¿»¯¾í", {2, 1, 30425, 1}, 0},
--		{1, 2, "14¼¶Ç¿»¯¾í", {2, 1, 30426, 1}, 0},
--		{1, 1, "15¼¶Ç¿»¯¾í", {2, 1, 30427, 1}, 0},
--		{1, 25, "²¼ÖÆ¸ßÍ²Ñ¥", {0,	154,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--		{1, 25, "ÓñÖÆ»ÕÕÂ", {0,	153,	3,	1, 4, -1, -1, -1, -1, -1, -1}, 0},
--		{31, 5, "qht_award_wuxing_foot_3()", ""},
--		{31, 5, "qht_award_wuxing_badge_3()", ""},
--		{31, 60, "nothing()", ""},
	{1, 1650, "HuyÕtTrÝchTh¹ch Lv2", {2, 22, 102, 1}, 0},
	{1, 1650, "NguyÖtB¹chTh¹ch Lv2", {2, 22, 202, 1}, 0},
	{1, 1650, "Hæ Ph¸ch Th¹ch CÊp 2", {2, 22, 302, 1}, 0},
	{1, 1650, "H¾c DiÖu Th¹ch CÊp 2", {2, 22, 402, 1}, 0},
	{1, 500, "HuyÕtTrÝchTh¹ch Lv3", {2, 22, 103, 1}, 0},
	{1, 500, "NguyÖtB¹chTh¹ch Lv3", {2, 22, 203, 1}, 0},
	{1, 500, "Hæ Ph¸ch Th¹ch CÊp 3", {2, 22, 303, 1}, 0},
	{1, 500, "H¾c DiÖu Th¹ch CÊp 3", {2, 22, 403, 1}, 0},
	{1, 95, "HuyÕtTrÝchTh¹ch Lv4", {2, 22, 104, 1}, 0},
	{1, 95, "NguyÖtB¹chTh¹ch Lv4", {2, 22, 204, 1}, 0},
	{1, 95, "Hæ Ph¸ch Th¹ch CÊp 4", {2, 22, 304, 1}, 0},
	{1, 95, "H¾c DiÖu Th¹ch CÊp 4", {2, 22, 404, 1}, 0},
	{31, 10, "qht_award_tianjiao(%d)", ""},
	{31, 5, "qht_award_tiangang(%d)", ""},
	{31, 5, "qht_award_tianmen(%d)", ""},
	{1, 600, "HiÖp NghÜa Chi Chøng", {2, 1, 30912, 50}, 0},
	-- {1, 300, "ºÚ±ª×Ó±¦±¦", {0, 105, 30029, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	-- {1, 300, "»Æ±ª×Ó±¦±¦", {0, 105, 30030, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{31, 200, "qht_award_heibao(%d)", ""},
	{31, 200, "qht_award_huangbao(%d)", ""},
}

--¸÷¹Ø¿¨²ú³öµÀ¾ß ÊÊÓÃgf_EventGiveRandAward
QHT_RAID_AWARD_LS_14 = {
	{1, 60, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 1, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 39, "nothing()", ""},
}

QHT_RAID_AWARD_LS_58 = {
	{1, 70, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 8, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 22, "nothing()", ""},
}

QHT_RAID_AWARD_WJ_13 = {
	{1, 70, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 2, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 28, "nothing()", ""},
}

QHT_RAID_AWARD_WJ_4 = {
	{1, 80, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 4, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 16, "nothing()", ""},
}

QHT_RAID_AWARD_TTD_13 = {
	{1, 80, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 3, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 17, "nothing()", ""},
}

QHT_RAID_AWARD_TTD_47 = {
	{1, 90, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 6, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 4, "nothing()", ""},
}

QHT_RAID_AWARD_DXG_13 = {
	{1, 60, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 1, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 39, "nothing()", ""},
}

QHT_RAID_AWARD_DXG_47 = {
	{1, 70, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 8, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 22, "nothing()", ""},
}

QHT_RAID_AWARD_TYT_13 = {
	{1, 80, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 3, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 17, "nothing()", ""},
}

QHT_RAID_AWARD_TYT_46 = {
	{1, 90, "M¶nh Hæ phï", {2, 1, 30435, 1}, 0},
	--{1, 0, "Í­ÎÆ»¢·û", {2, 1, 30436, 1}, 0},
	--{1, 0, "ÒøÎÆ»¢·û", {2, 1, 30437, 1}, 0},
	{31, 6, "qht_award_jinwenhufu(1,100,100)", ""},
	{31, 4, "nothing()", ""},
}

--×øÆï
QHT_AWARD_HORSE = {
	{1, 33, "B¸o Tr¾ng B¶o B¶o", {0, 105, 30028, 1, 1, -1, -1, -1, -1, -1, -1}, 0},
	{1, 34, "B¸o §en B¶o B¶o", {0, 105, 30029, 1, 1, -1, -1, -1, -1, -1, -1}, 0},
	{1, 33, "B¸o Vµng B¶o B¶o", {0, 105, 30030, 1, 1, -1, -1, -1, -1, -1, -1}, 0},
}

QHT_AWARD_BADGE_3 = {
	{1, 17, "ChiÕn Hµi Kim ChÕ ngò hµnh", {0, 154, 4, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "ChiÕn Hµi Méc ChÕ ngò hµnh", {0, 154, 5, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "ChiÕn Hµi Thñy ChÕ ngò hµnh", {0, 154, 6, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "ChiÕn Hµi Háa ChÕ ngò hµnh", {0, 154, 7, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 16, "ChiÕn Hµi Thæ ChÕ ngò hµnh", {0, 154, 8, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 16, "ChiÕn Hµi ¢m ChÕ ngò hµnh", {0, 154, 9, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
}

QHT_AWARD_FOOT_3 = {
	{1, 17, "Huy Ch­¬ng Kim ChÕ ngò hµnh", {0, 153, 4, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "Huy Ch­¬ng Méc ChÕ ngò hµnh", {0, 153, 5, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "Huy Ch­¬ng Thñy ChÕ ngò hµnh", {0, 153, 6, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 17, "Huy Ch­¬ng Háa ChÕ ngò hµnh", {0, 153, 7, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 16, "Huy Ch­¬ng Thæ ChÕ ngò hµnh", {0, 153, 8, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
	{1, 16, "Huy Ch­¬ng ¢m ChÕ ngò hµnh", {0, 153, 9, 1, 4, -1, -1, -1, -1, -1, -1}, 0},
}
